Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-versioning_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-versioning title: Versioning Policy permalink: docs/faq-versioning.html layout: docs category: FAQ ---
ja: --- id: faq-versioning title: バージョニングポリシー permalink: docs/faq-versioning.html layout: docs category: FAQ ---

source: React follows [semantic versioning (semver)](https://semver.org/) principles.
ja: React は[セマンティック バージョニング (semantic versioning; semver)](https://semver.org/) の原則に従います。

source: That means that with a version number **x.y.z**:
ja: すなわちバージョン番号は **x.y.z** になります。

source: * When releasing **critical bug fixes**, we make a **patch release** by changing the **z** number (ex: 15.6.2 to 15.6.3).
ja: * **バグ修正**をする時、**z** の番号を変更することで**パッチリリース**をします（例 15.6.2 から 15.6.3）。

source: * When releasing **new features** or **non-critical fixes**, we make a **minor release** by changing the **y** number (ex: 15.6.2 to 15.7.0).
ja: * **新機能追加**をする時、**y** の番号を変更することで**マイナーリリース**をします（例 15.6.2 から 15.7.0）。

source: * When releasing **breaking changes**, we make a **major release** by changing the **x** number (ex: 15.6.2 to 16.0.0).
ja: * **破壊的変更**をする時、**x** の番号を変更することで**メジャーリリース**をします（例 15.6.2 から 16.0.0）。

source: Major releases can also contain new features, and any release can include bug fixes.
ja: メジャーリリースには新機能を含むことができ、全てのリリースにバグ修正を含められます。

source: Minor releases are the most common type of release.
ja: マイナーリリースは、最も一般的なリリースです。

source: > This versioning policy does not apply to prerelease builds in the Next or Experimental channels.
ja: > このバージョニングポリシーは Next と Experimental チャンネルのプレリリースビルドには適用されません。

source: [Learn more about prereleases.](/docs/release-channels.html)
ja: [プレリリースについての詳細](/docs/release-channels.html)

source: ### Breaking Changes {#breaking-changes}
ja: ### 破壊的変更 {#breaking-changes}

source: Breaking changes are inconvenient for everyone, so we try to minimize the number of major releases
ja: 破壊的変更は誰にとっても不便なので、私たちはメジャーリリースを最小限にするようにしています。

source: – for example, React 15 was released in April 2016 and React 16 was released in September 2017, and React 17 was released in October 2020.
ja: 例えば React 15 は 2016 年 4 月にリリースされており、React 16 は 2017 年の 9 月にリリースされています。

source: Instead, we release new features in minor versions.
ja: React 17 は 2020 年 10 月にリリースされました。

source: That means that minor releases are often more interesting and compelling than majors, despite their unassuming name.
ja: その代わり、新機能のリリースをマイナーバージョンでしています。つまりマイナーリリースは控えめな名前にも関わらず、メジャーリリースよりしばしば興味深く魅力的です。

source: ### Commitment to Stability {#commitment-to-stability}
ja: ### 安定性への取り組み {#commitment-to-stability}

source: As we change React over time, we try to minimize the effort required to take advantage of new features.
ja: React が徐々に変化していく中で、私たちは新機能を取り入れるために必要な労力を最小限にするようにしています。

source: When possible, we'll keep an older API working, even if that means putting it in a separate package.
ja: 別のパッケージに入れることはあっても、可能な限り古い API が動作するように保ちます。

source: For example, [mixins have been discouraged for years](/blog/2016/07/13/mixins-considered-harmful.html) but they're supported to this day [via create-react-class](/docs/react-without-es6.html#mixins) and many codebases continue to use them in stable, legacy code.
ja: 例えば[ミックスインは長年推奨されていません](/blog/2016/07/13/mixins-considered-harmful.html)が [create-react-class を通じて](/docs/react-without-es6.html#mixins)今日までサポートされており、多くのレガシーコードが安定してそれらを継続使用しています。

source: Over a million developers use React, collectively maintaining millions of components.
ja: 100 万人を超える開発者が React を使用し、合わせると何百万ものコンポーネントを管理しています。

source: The Facebook codebase alone has over 50,000 React components.
ja: Facebook のコードベースだけでも 5 万以上の React コンポーネントがあります。

source: That means we need to make it as easy as possible to upgrade to new versions of React;
ja: なので React はできるだけ簡単に新バージョンにアップグレードできるようにする必要があります。

source: if we make large changes without a migration path, people will be stuck on old versions.
ja: もし移行手段なしに React へ大きな変更を行えば、開発者は古いバージョンにとどまるでしょう。

source: We test these upgrade paths on Facebook itself
ja: 私たちはアップグレード方法を Facebook 自体でテストしています。

source: – if our team of less than 10 people can update 50,000+ components alone, we hope the upgrade will be manageable for anyone using React.
ja: 10 人以下の私たちのチームが単独で 5 万以上のコンポーネントをアップデートできるなら、React を使用している全ての人にとって管理しやすいアップグレードであると見込めます。

source: In many cases, we write [automated scripts](https://github.com/reactjs/react-codemod) to upgrade component syntax, which we then include in the open-source release for everyone to use.
ja: 多くの場合、私たちはコンポーネントの構文をアップグレードするための[自動化スクリプト](https://github.com/reactjs/react-codemod)を書き、オープンソースのリリースに含め誰でも使用できるようにしています。

source: ### Gradual Upgrades via Warnings {#gradual-upgrades-via-warnings}
ja: ### 警告による段階的アップグレード {#gradual-upgrades-via-warnings}

source: Development builds of React include many helpful warnings.
ja: React の開発ビルドは多くの有益な警告を含みます。

source: Whenever possible, we add warnings in preparation for future breaking changes.
ja: 可能な限り、私たちは将来の破壊的変更に備える警告を追加します。

source: That way, if your app has no warnings on the latest release, it will be compatible with the next major release.
ja: 最新のリリースでもしあなたのアプリが警告を出さないのであれば、次期メジャーリリースとの互換性があるでしょう。

source: This allows you to upgrade your apps one component at a time.
ja: これによりアプリを 1 つのコンポーネントずつアップグレードすることが可能になります。

source: Development warnings won't affect the runtime behavior of your app.
ja: 開発時の警告はあなたのアプリの実行に影響しません。

source: That way, you can feel confident that your app will behave the same way between the development and production builds
ja: なので開発ビルドと本番ビルドでアプリの動作は同じであると確信できます。

source: -- the only differences are that the production build won't log the warnings and that it is more efficient.
ja: 違いは、本番ビルドは警告をロギングしないこと、そして本番ビルドはより効率的に動作すること、の 2 点のみです

source: (If you ever notice otherwise, please file an issue.)
ja: （万一そうなっていないことに気づいた場合は、issue を作成してください）。

source: ### What Counts as a Breaking Change?
ja: ### 何を破壊的変更とみなすのか？

source: In general, we *don't* bump the major version number for changes to:
ja: 通常、私たちは下記の変更ではメジャー番号を*上げません*。

source: * **Development warnings.
ja: * **開発時の警告。

source: ** Since these don't affect production behavior, we may add new warnings or modify existing warnings in between major versions.
ja: **これらは本番環境の動作に影響を与えないので、新しい警告の追加や既存の警告の修正はメジャーバージョンの間で行います。

source: In fact, this is what allows us to reliably warn about upcoming breaking changes.
ja: これにより次期の破壊的変更を確実に警告することができるのです。

source: * **APIs starting with `unstable_`.
ja: * **`unstable_` から始まる API 。

source: ** These are provided as experimental features whose APIs we are not yet confident in.
ja: **これらは、API をまだ信頼することができない、実験的な機能として提供されます。

source: By releasing these with an `unstable_` prefix, we can iterate faster and get to a stable API sooner.
ja: `unstable_`という接頭語をつけてリリースすることで、より速く開発サイクルを進め、より早く安定した API にすることができます。

source: * **Alpha and canary versions of React.
ja: * **React のアルファバージョンとカナリア (canary) バージョン。

source: ** We provide alpha versions of React as a way to test new features early, but we need the flexibility to make changes based on what we learn in the alpha period.
ja: **新機能を早くテストするために React のアルファバージョンを提供しますが、アルファで学んだことを基に柔軟に変更を加える必要があります。

source: If you use these versions, note that APIs may change before the stable release.
ja: もしこれらのバージョンを使用する場合は、安定板のリリース前に API が変わる可能性に注意してください。

source: * **Undocumented APIs and internal data structures.
ja: * **ドキュメント化されていない API と内部データ構造。

source: ** If you access internal property names like `__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED` or `__reactInternalInstance$uk43rzhitjg`, there is no warranty.
ja: **もし内部プロパティである `__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED` や `__reactInternalInstance$uk43rzhitjg` などにアクセスしたいのであれば保証はされません。

source: You are on your own.
ja: 自己責任で行ってください。

source: This policy is designed to be pragmatic: certainly, we don't want to cause headaches for you.
ja: このポリシーはみなさんの頭痛の種とならないよう、実用的に構成されています。

source: If we bumped the major version for all of these changes, we would end up releasing more major versions and ultimately causing more versioning pain for the community.
ja: 上記の全ての変更のためにメジャーバージョンを上げると、より多くメジャーリリースが必要になり、最終的により多くのバージョニングの問題をコミュニティに対して引き起こすことになります。

source: It would also mean that we can't make progress in improving React as fast as we'd like.
ja: それは React の改善を私たちが望むほど早くできないことも意味します。

source: That said, if we expect that a change on this list will cause broad problems in the community, we will still do our best to provide a gradual migration path.
ja: それでも、上記のリストのような変更がコミュニティ内で広域に渡る問題を引き起こすと予想される場合は、私たちは段階的な移行手段を提供するように最善を尽くします。

source: ### If a Minor Release Includes No New Features, Why Isn't It a Patch?
ja: ### 新機能がない場合でもパッチではなくマイナーリリースになる理由は？

source: It's possible that a minor release will not include new features.
ja: マイナーリリースに新機能がないということはあり得ます。

source: [This is allowed by semver](https://semver.org/#spec-item-7), which states **"[a minor version] MAY be incremented if substantial new functionality or improvements are introduced within the private code.
ja: [これは semver で許容されており](https://semver.org/#spec-item-7)、具体的には**「（マイナーバージョンは）非公開のコード内で大きな機能追加や改善があった場合に上げても良い (MAY)。

source: It MAY include patch level changes."**
ja: パッチレベルの変更を含んでいても良い (MAY)」**ことになっています。

source: However, it does raise the question of why these releases aren't versioned as patches instead.
ja: それでも、そのようなリリースがパッチリリースとしてバージョニングされないのは何故かというもっともな疑問が湧いてきます。

source: The answer is that any change to React (or other software) carries some risk of breaking in unexpected ways.
ja: 答えは、React やその他のソフトウエアに対するあらゆる変更には、想定外にコードが壊れるリスクがあるからです。

source: Imagine a scenario where a patch release that fixes one bug accidentally introduces a different bug.
ja: とあるバグを修正するためのパッチリリースが別のバグを引き起こすという状況を想像してください。

source: This would not only be disruptive to developers, but also harm their confidence in future patch releases.
ja: 開発者を混乱させるだけでなく、将来のパッチリリースに対する信頼を失わせることになります。

source: It's especially regrettable if the original fix is for a bug that is rarely encountered in practice.
ja: 元の修正が現実には滅多に発生しないバグに対するものだった場合は、特に残念なことになります。

source: We have a pretty good track record for keeping React releases free of bugs, but patch releases have an even higher bar for reliability because most developers assume they can be adopted without adverse consequences.
ja: React のリリースにバグを含めないことに関して我々はかなり良い成績を残してきていますが、ほとんどの開発者はパッチリリースは有害な副作用なしに採用できるものと当然に考えているので、パッチリリースに関しては信頼性のハードルがさらに上がります。

source: For these reasons, we reserve patch releases only for the most critical bugs and security vulnerabilities.
ja: このような理由により、我々はパッチリリースを重大なバグやセキュリティの脆弱性の修正のみに利用することにしています。

source: If a release includes non-essential changes — such as internal refactors, changes to implementation details, performance improvements, or minor bugfixes — we will bump the minor version even when there are no new features.
ja: リリースがあまり本質的でない変更、例えば内部のリファクタリング、実装の詳細の変更、パフォーマンス改善、小さなバグ修正といったものに関する場合、我々は新機能がなくともマイナーバージョンを上げます。
